
DeviceInfo 
| where Timestamp between ((startofday(datetime(now), -1)) .. (endofday(datetime(now), -1)))
|where isnotempty(OSDistribution) and OSDistribution !contains "WindowsServer" and SensorHealthState contains_cs "Inactive"
| summarize arg_max(Timestamp, *) by DeviceId
|where OSDistribution contains "Windows" and OSDistribution !contains "WVD"
|where IsExcluded==0
|project Timestamp,DeviceId,DeviceName,PublicIP,OSPlatform,OSArchitecture,OSDistribution,OSVersionInfo,SensorHealthState
| join kind = inner (
DeviceInfo 
| where Timestamp between ((startofday(datetime(now), -1)) .. (endofday(datetime(now), -0)))
|where isnotempty(OSDistribution) and OSDistribution !contains "WindowsServer" and SensorHealthState contains_cs "Active"
| summarize arg_max(Timestamp, *) by DeviceId
|where OSDistribution contains "Windows" and OSDistribution !contains "WVD"
|where IsExcluded==0
| project SensorHealthState,DeviceId
 ) on DeviceId
|where SensorHealthState1 != "Active"
| join kind = inner (
DeviceNetworkInfo 
| where Timestamp between ((startofday(datetime(now), -1)) .. (endofday(datetime(now), -1)))
| where isnotempty(IPAddresses) and NetworkAdapterName !contains "lo" and NetworkAdapterStatus contains "Up"
| mv-expand IP = todynamic(['IPAddresses'])
|extend IPAddresses=parse_json(IP.IPAddress)
|where IPAddresses contains_cs "10."
| summarize arg_max(Timestamp, *) by DeviceId
|project DeviceId,IPAddresses
)on DeviceId
|project Timestamp,DeviceName,PublicIP,PrivateIP=IPAddresses, OSPlatform,OSArchitecture,OSDistribution,OSVersionInfo,SensorHealthState
